freddygaffey/Lflip/esp32/src/edge/main.cpp
// EDGE firmware — plate controller. Battery powered. Identical on every edge.
//
//   * Unpaired (fresh out of the box): broadcast PAIR_REQ until a master answers,
//     then save the master's MAC to flash.
//   * Paired: poll the master for the desired plate state and act.
//   * Button: tap = re-pair (forget master); hold 5 s = factory reset.
//   * USB gesture: with the lead in a computer, unplug/replug it a few times in
//     quick succession to factory-reset (see pollUsbGesture). Handy when there's
//     no button to hand — the battery keeps the board alive while USB is out.
//
// (Servo + deep sleep come in a later phase; for now it logs the move.)
#include <Arduino.h>
#include <WiFi.h>
#include <esp_wifi.h>
#include <esp_now.h>
#include <Preferences.h>
#include <ESP32Servo.h>
#include "esp32-hal.h"
#include "protocol.h"
#include "battery.h"

constexpr int PIN_BUTTON    = D1;   // re-pair / reset button to GND
constexpr int PIN_LED       = D2;   // status LED (blinks while pairing)
constexpr int PIN_SERVO_PWR = D9;   // MOSFET gate: HIGH = servo powered, LOW = off
constexpr int PIN_SERVO_PWM = D10;  // servo control signal (PWM)

// Servo travel, in PWM microseconds (NOT degrees). Driving by µs lets us set the
// two end-points just SHORT of the mechanical stops so the servo never stalls and
// grinds against them. These are per-edge and saved in flash; calibrate each plate
// from the app (or the serial jog mode) to its own stops. The defaults are a safe
// centred range so a fresh, uncalibrated board can't slam into a stop.
constexpr int SERVO_US_MIN  = 500;     // absolute clamp — never command outside
constexpr int SERVO_US_MAX  = 2500;    // these (servo's electrical limits)
// Three positions: L face, CENTER (edge-on / off), P face. Safe centred defaults
// until calibrated; the user dials each to its real spot from the app.
constexpr int SERVO_L_US_DEFAULT      = 1300;
constexpr int SERVO_CENTER_US_DEFAULT = 1500;
constexpr int SERVO_P_US_DEFAULT      = 1700;
// Motion is RAMPED (stepped) rather than a single slam to the target. Moving
// slowly limits the servo's peak current so it can't brown out the shared rail
// (there is no power MOSFET fitted — the servo runs straight off the ESP's rail),
// and it makes the travel smooth. Tune STEP_MS up = gentler/slower.
constexpr int      SERVO_STEP_US   = 15;    // pulse increment per ramp step
constexpr uint32_t SERVO_STEP_MS   = 12;    // delay per step (speed -> peak current)
constexpr uint32_t SERVO_SETTLE_MS = 120;   // hold at target before releasing PWM
constexpr uint32_t SERVO_BOOT_DELAY_MS = 1500;  // don't drive the servo until ~1.5s after boot

// Calibrated positions, loaded from flash (fall back to the safe defaults).
int lUs      = SERVO_L_US_DEFAULT;
int centerUs = SERVO_CENTER_US_DEFAULT;
int pUs      = SERVO_P_US_DEFAULT;

// Map a logical plate position to its calibrated servo pulse.
static int usForState(PlateState s) {
  switch (s) {
    case PlateState::L: return lUs;
    case PlateState::P: return pUs;
    default:            return centerUs;   // CENTER
  }
}

Servo plateServo;

static const uint8_t BCAST[6] = { 0xFF,0xFF,0xFF,0xFF,0xFF,0xFF };
constexpr uint32_t POLL_EVERY = 3000;   // ms between polls (30000 later)
constexpr uint32_t REQ_EVERY  = 700;    // ms between pair requests
constexpr uint32_t CONNECT_WINDOW = 60000;  // on boot, try saved master this long before pairing

// ── "unplug/replug the USB lead a few times to factory-reset" gesture ─────────
// The board is battery-powered, so pulling the lead doesn't reset it — we can
// watch the cable come and go. The C3's native USB peripheral flags host
// presence from the 1 kHz SOF frames the host broadcasts (HWCDC::isPlugged), so
// this needs no extra wiring or VBUS-sense pin. Re-insert the lead this many
// times inside the window and the plate factory-resets: same as the serial 'r'
// key or a 5 s button hold (wipes the saved master AND servo calibration).
constexpr uint8_t  REPLUGS_TO_RESET  = 3;      // re-insertions needed to trigger
constexpr uint32_t GESTURE_WINDOW_MS = 12000;  // they must all land inside this
constexpr uint32_t PLUG_DEBOUNCE_MS  = 200;    // ignore edges faster than a human

// Three-state machine driving loop():
//   CONNECTING — paired board just booted; trying to reach its saved master.
//   ONLINE     — master answered; normal poll-and-move.
//   PAIRING    — no master found (or never paired); broadcast to be adopted.
enum class Mode : uint8_t { CONNECTING, ONLINE, PAIRING };
Mode     mode;
uint32_t connectStart = 0;   // millis() when CONNECTING began (for the 60s window)

Preferences prefs;
bool       paired = false;
uint8_t    masterMac[6];
PlateState myState = PlateState::CENTER;   // boot to the "off" position

// filled by the recv callback, acted on in loop()
volatile bool       gotCmd    = false;
volatile PlateState cmdWant   = PlateState::CENTER;
volatile uint16_t   cmdPollMs = POLL_EVERY;   // idle poll interval the master last asked for
volatile bool       gotAck    = false;
volatile bool       gotUnpair = false;   // master told us to disconnect
uint8_t             ackMaster[6];

// servo calibration request (over-the-air, from the app via the master).
volatile bool       gotCal    = false;
volatile uint8_t    calAction = 0;        // see ServoCalMsg::action in protocol.h
volatile uint16_t   calUs     = 1500;
bool                calLive   = false;    // servo currently powered for jogging?
uint32_t            calLastMs = 0;        // millis() of last jog (for auto power-off)

// ── persistence ─────────────────────────────────────────────────────────────
static void saveConfig() {
  prefs.begin("lplate", false);
  prefs.putBool("paired", paired);
  prefs.putBytes("mmac", masterMac, 6);
  prefs.end();
}

static void loadConfig() {
  prefs.begin("lplate", true);
  paired = prefs.getBool("paired", false);
  prefs.getBytes("mmac", masterMac, 6);
  lUs      = prefs.getUShort("lUs",      SERVO_L_US_DEFAULT);        // calibrated positions
  centerUs = prefs.getUShort("centerUs", SERVO_CENTER_US_DEFAULT);
  pUs      = prefs.getUShort("pUs",      SERVO_P_US_DEFAULT);
  prefs.end();
  Serial.printf("paired=%s  servo L=%dus C=%dus P=%dus\n",
                paired ? "yes" : "no", lUs, centerUs, pUs);
}

