freddygaffey/Lflip/esp32/src/edge/main.cpp
// Persist the servo positions (called when calibration saves one).
static void saveServoCal() {
  prefs.begin("lplate", false);
  prefs.putUShort("lUs",      lUs);
  prefs.putUShort("centerUs", centerUs);
  prefs.putUShort("pUs",      pUs);
  prefs.end();
  Serial.printf("saved servo cal: L=%dus C=%dus P=%dus\n", lUs, centerUs, pUs);
}

static void factoryReset() {
  Serial.println("FACTORY RESET");
  prefs.begin("lplate", false);
  prefs.clear();
  prefs.end();
  delay(200);
  ESP.restart();
}

// ── ESP-NOW ─────────────────────────────────────────────────────────────────
static void addBroadcastPeer() {
  if (esp_now_is_peer_exist(BCAST)) return;
  esp_now_peer_info_t p = {};
  memcpy(p.peer_addr, BCAST, 6);
  p.channel = ESPNOW_CHANNEL;
  p.encrypt = false;
  esp_now_add_peer(&p);
}

static void addMaster() {
  if (esp_now_is_peer_exist(masterMac)) esp_now_del_peer(masterMac);
  esp_now_peer_info_t p = {};
  memcpy(p.peer_addr, masterMac, 6);
  p.channel = ESPNOW_CHANNEL;
  p.encrypt = false;
  esp_now_add_peer(&p);
}

void onEspNowRecv(const uint8_t* mac, const uint8_t* data, int len) {
  if (len < 2) return;
  if (data[0] != PROTO_VERSION) return;
  MsgType type = (MsgType)data[1];

  if (type == MsgType::PAIR_ACK && !paired) {
    memcpy(ackMaster, mac, 6);                  // master's MAC = packet sender
    gotAck = true;                              // finish the work in loop()
  } else if (type == MsgType::CMD && paired) {
    if (memcmp(mac, masterMac, 6) != 0) return; // only our master
    CmdMsg cmd; memcpy(&cmd, data, sizeof(cmd));
    cmdWant   = cmd.desired;
    cmdPollMs = cmd.next_poll_ms;
    gotCmd    = true;
  } else if (type == MsgType::UNPAIR && paired) {
    if (memcmp(mac, masterMac, 6) != 0) return; // only our master can evict us
    gotUnpair = true;                           // forget it in loop()
  } else if (type == MsgType::SERVO_CAL && paired) {
    if (memcmp(mac, masterMac, 6) != 0) return; // only our master
    if ((size_t)len < sizeof(ServoCalMsg)) return;
    ServoCalMsg m; memcpy(&m, data, sizeof(m));
    calAction = m.action;
    calUs     = m.us;
    gotCal    = true;                           // act on it in loop()
  }
}

void initEspNow() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
  if (esp_now_init() != ESP_OK) { Serial.println("ESP-NOW init FAILED"); return; }
  esp_now_register_recv_cb(onEspNowRecv);
  addBroadcastPeer();
  if (paired) addMaster();
  Serial.printf("ESP-NOW up, my MAC %s\n", WiFi.macAddress().c_str());
}

static void sendPairReq() {
  PairReqMsg req = { PROTO_VERSION, MsgType::PAIR_REQ };
  esp_now_send(BCAST, (uint8_t*)&req, sizeof(req));
  Serial.println("PAIR_REQ broadcast...");
}

static void sendPoll() {
  PollMsg poll = {};
  poll.version = PROTO_VERSION;
  poll.type    = MsgType::POLL;
  poll.battMv  = (uint16_t)(batt::volts() * 1000.0f);   // real cell voltage (0 if no A0 divider wired)
  poll.current = myState;
  esp_now_send(masterMac, (uint8_t*)&poll, sizeof(poll));
}

// Move the plate: power the servo (MOSFET on), drive it to the angle, wait,
// then cut power. The plate rests on a mechanical stop so it holds with no draw.
// The PWM line is forced LOW before cutting power so it can't backfeed the
// unpowered servo through its signal pin.
static void movePlate(PlateState s) {
  const int target = usForState(s);
  int cur = usForState(myState);                    // assume we're at our last position
  Serial.printf("  -> moving plate %u -> %u (%d->%d us)\n",
                (unsigned)myState, (unsigned)s, cur, target);

  digitalWrite(PIN_SERVO_PWR, HIGH);               // inert without a MOSFET; correct if one is fitted
  plateServo.attach(PIN_SERVO_PWM, SERVO_US_MIN, SERVO_US_MAX);
  plateServo.writeMicroseconds(cur);               // start where we are -> no jump to the middle

  // Ramp gently to the target. Small steps = low angular speed = low peak current,
  // so an always-powered servo can't sag the rail into a brownout. Also smooth.
  const int step = (target >= cur) ? SERVO_STEP_US : -SERVO_STEP_US;
  while (abs(target - cur) > SERVO_STEP_US) {
    cur += step;
    plateServo.writeMicroseconds(cur);
    delay(SERVO_STEP_MS);
  }
  plateServo.writeMicroseconds(target);
  delay(SERVO_SETTLE_MS);

  plateServo.detach();                             // release: no signal -> analog servo relaxes (low draw)
  pinMode(PIN_SERVO_PWM, OUTPUT);
  digitalWrite(PIN_SERVO_PWM, LOW);                // idle the signal line
  digitalWrite(PIN_SERVO_PWR, LOW);
  myState = s;
}

// ── servo calibration ─────────────────────────────────────────────────────────
// Power the servo and hold it at `us` so you can SEE where the arm sits, then
// note the value just shy of each stop and save it as the UP or DOWN end-point.
// Driven by the serial jog keys AND over-the-air from the app (via the master).
// The servo stays powered between jogs and auto-cuts after a few idle seconds
// (checkCalTimeout) so a stalled servo can't sit there draining the cell.
static void servoJog(int us) {
  us = constrain(us, SERVO_US_MIN, SERVO_US_MAX);
  if (!calLive) {                                 // first jog — attach and drive
    digitalWrite(PIN_SERVO_PWR, HIGH);            // inert without a MOSFET
    plateServo.attach(PIN_SERVO_PWM, SERVO_US_MIN, SERVO_US_MAX);
    calLive = true;
  }
  plateServo.writeMicroseconds(us);
  calUs     = us;
  calLastMs = millis();
  Serial.printf("CAL jog us=%d\n", us);
}

static void servoCalOff() {
  if (!calLive) return;
  plateServo.detach();
  pinMode(PIN_SERVO_PWM, OUTPUT);
  digitalWrite(PIN_SERVO_PWM, LOW);
  digitalWrite(PIN_SERVO_PWR, LOW);
  calLive = false;
  Serial.println("CAL servo off");
}

// Apply a calibration request that arrived over the air (set by the callback).
// action: 0 = live jog, 1 = save µs as L, 2 = save as P, 4 = save as CENTER,
//         3 = end/power-off.
static void handleCal() {
  if (!gotCal) return;
  gotCal = false;
  switch (calAction) {
    case 0: servoJog(calUs); break;
    case 1: lUs      = constrain((int)calUs, SERVO_US_MIN, SERVO_US_MAX); saveServoCal(); break;
    case 2: pUs      = constrain((int)calUs, SERVO_US_MIN, SERVO_US_MAX); saveServoCal(); break;
    case 4: centerUs = constrain((int)calUs, SERVO_US_MIN, SERVO_US_MAX); saveServoCal(); break;
    case 3: servoCalOff(); break;
  }
}

// Cut servo power if a jog session has gone idle (no jog for a few seconds).
static void checkCalTimeout() {
  if (calLive && millis() - calLastMs > 8000) servoCalOff();
}

// ── button: 0 none, 1 short press, 2 long (5s) press ──────────────────────────
int pollButton() {
  static bool down = false; static uint32_t downAt = 0; static bool longFired = false;
  bool now = digitalRead(PIN_BUTTON) == LOW;
  uint32_t t = millis();
  if (now && !down)      { down = true; downAt = t; longFired = false; }
  else if (now && down)  { if (!longFired && t - downAt >= 5000) { longFired = true; return 2; } }
  else if (!now && down) { down = false; if (!longFired && t - downAt >= 30) return 1; }
  return 0;
}

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.printf("\nEDGE online — protocol v%u\n", PROTO_VERSION);
  pinMode(PIN_BUTTON, INPUT_PULLUP);
  pinMode(PIN_LED, OUTPUT);
  pinMode(PIN_SERVO_PWR, OUTPUT);
  digitalWrite(PIN_SERVO_PWR, LOW);          // servo unpowered at boot
  pinMode(PIN_SERVO_PWM, OUTPUT);
  digitalWrite(PIN_SERVO_PWM, LOW);          // idle the signal line (no backfeed)
  loadConfig();
  initEspNow();

  // Paired board reboot: try the saved master first (CONNECTING). A board that
  // was never paired goes straight to broadcasting (PAIRING).
  mode = paired ? Mode::CONNECTING : Mode::PAIRING;
  connectStart = millis();
}

