freddygaffey/Lflip/esp32/src/edge/main.cpp
// Forget our master and drop back to pairing. Called from BOTH the button and
// the serial 'p' command — writing it once as a named function (instead of the
// same 4 lines twice) is the "don't repeat yourself" rule: fix a bug here once
// and it's fixed in both places.
static void forgetMaster() {
  if (paired && esp_now_is_peer_exist(masterMac)) esp_now_del_peer(masterMac);
  paired = false;
  saveConfig();                 // persist: a power-cycle mustn't revive the old master
  mode = Mode::PAIRING;
  Serial.println("re-pairing requested");
}

// Blink the status LED n times — used to confirm a counted USB re-plug even
// though there's no serial to watch while the lead is out.
static void blinkLed(uint8_t n) {
  for (uint8_t i = 0; i < n; i++) {
    digitalWrite(PIN_LED, HIGH); delay(60);
    digitalWrite(PIN_LED, LOW);  delay(120);
  }
}

// Watch the USB lead and count re-insertions; on the Nth within the window,
// factory-reset (same as the serial 'r' key). HWCDC::isPlugged() reads the C3's
// live host-present flag (kept up to date from USB SOF frames by a core tick
// hook), so it's true whenever the cable is in an enumerating host, whether or
// not a serial monitor is open. Polled often — loop() top AND during the long
// idle wait — so a whole out-and-in can't slip between two samples. factoryReset
// reboots, so on success this never actually returns.
static void pollUsbGesture() {
#if ARDUINO_USB_CDC_ON_BOOT
  static bool     init       = false;
  static bool     wasPlugged = false;
  static uint8_t  replugs    = 0;
  static uint32_t firstMs    = 0;
  static uint32_t lastEdgeMs = 0;

  bool plugged = HWCDC::isPlugged();
  if (!init) { wasPlugged = plugged; init = true; return; }         // no phantom edge at boot
  if (plugged == wasPlugged) return;                               // steady — nothing to do

  uint32_t now = millis();
  if (now - lastEdgeMs < PLUG_DEBOUNCE_MS) return;                 // bounce — let it settle
  lastEdgeMs = now;
  bool rising = plugged && !wasPlugged;                            // unplugged -> plugged = a re-plug
  wasPlugged  = plugged;
  if (!rising) return;                                             // only count re-insertions

  if (replugs == 0 || now - firstMs > GESTURE_WINDOW_MS) {         // (re)start the window
    replugs = 0; firstMs = now;
  }
  replugs++;
  Serial.printf("USB re-plug %u/%u\n", replugs, REPLUGS_TO_RESET);
  blinkLed(replugs);

  if (replugs >= REPLUGS_TO_RESET) {
    replugs = 0;
    Serial.println("USB gesture -> factory reset");
    factoryReset();                                               // wipes flash + reboots (never returns)
  }
#endif
}

// A delay() that keeps watching the USB lead, so an unplug/replug during a long
// idle poll gap still registers (the gesture reboots the board when it fires).
static void usbAwareDelay(uint32_t ms) {
  uint32_t start = millis();
  while (millis() - start < ms) {
    pollUsbGesture();
    delay(20);
  }
}

// Bench testing without a physical button: type a letter in the serial monitor.
//   p = re-pair (forget master)   r = factory reset   s = status
//   (or, no keyboard: unplug/replug the USB lead 3x = 'r' — see pollUsbGesture)
//   c = start servo calibration; then +/- = ±25us, ]/[ = ±100us,
//       l/m/p = save current as L / Center / P, x = finish
void handleSerial() {
  if (!Serial.available()) return;
  char c = Serial.read();

  // Servo jog keys — only while a calibration session is live.
  if (calLive) {
    switch (c) {
      case '+': servoJog(calUs + 25);  return;
      case '-': servoJog(calUs - 25);  return;
      case ']': servoJog(calUs + 100); return;
      case '[': servoJog(calUs - 100); return;
      case 'l': lUs      = calUs; saveServoCal(); return;   // save L
      case 'm': centerUs = calUs; saveServoCal(); return;   // save Center (middle)
      case 'p': pUs      = calUs; saveServoCal(); return;   // save P
      case 'x': servoCalOff(); return;
    }
  }

  switch (c) {
    case 'p': forgetMaster();   break;
    case 'r': factoryReset();   break;
    case 'c': servoJog(1500);   break;            // start calibration, centred
    case 's': Serial.printf("status: paired=%d, myState=%u, L=%dus C=%dus P=%dus\n",
                            paired, (unsigned)myState, lUs, centerUs, pUs); break;
  }
}

// ─────────────────────────────────────────────────────────────────────────────
//  The board is always in ONE of three modes. Each mode is its own function
//  below, so loop() reads like a sentence. Read loop() (at the very bottom)
//  first, then jump into whichever mode function you care about — put the cursor
//  on the name and press `gd` (go to definition).
//
//      boot ──paired?──► CONNECTING ──master replies──► ONLINE
//                            │ silent 60s                (poll & move, forever)
//                            ▼
//                         PAIRING ──master adopts us──► ONLINE
// ─────────────────────────────────────────────────────────────────────────────

// Every 5s: if the battery is too low, cut the servo and deep-sleep so we can't
// over-discharge the cell. (Needs the A0 divider wired; without it reads ~0.)
static void checkBattery() {
  // `static` inside a function = this variable keeps its value between calls
  // (like a global, but only THIS function can see it). Same trick as pollButton.
  static uint32_t lastCheck = 0;
  if (millis() - lastCheck < 5000) return;   // not time yet — leave early
  lastCheck = millis();

  if (!batt::isLow()) return;                // battery fine — nothing to do
  digitalWrite(PIN_SERVO_PWR, LOW);          // cut servo power
  plateServo.detach();
  pinMode(PIN_SERVO_PWM, OUTPUT);
  digitalWrite(PIN_SERVO_PWM, LOW);
  digitalWrite(PIN_LED, LOW);
  batt::parkForever();                       // deep sleep — never returns
}

// Button: short press = re-pair, 5s hold = factory reset.
static void handleButton() {
  switch (pollButton()) {                    // `gd` on pollButton to see 0/1/2
    case 1: forgetMaster(); break;
    case 2: factoryReset(); break;
  }
}

