freddygaffey/Lflip/esp32/src/edge/main.cpp
// CONNECTING — a paired board that just booted. Poke the saved master and listen.
static void tryReconnect() {
  digitalWrite(PIN_LED, HIGH);               // solid LED = trying to reconnect
  gotCmd = false;
  sendPoll();
  uint32_t start = millis();
  while (!gotCmd && millis() - start < 500) { delay(5); }

  // >>> TODO 1 <<<  Master replied this round? (the callback set gotCmd = true)
  //   If so, switch mode to Mode::ONLINE and `return;`.
  //
  if (gotCmd){ if (mode == Mode::CONNECTING) {
    mode = Mode::ONLINE;
    return;
  }}


  // >>> TODO 2 <<<  Silent for the whole window?
  //   Compare millis() - connectStart against CONNECT_WINDOW (rollover-safe form).
  //   If past it: set paired = false; set mode = Mode::PAIRING; then return.
  //   EXERCISE: why set paired = false first? Press `gd` on onEspNowRecv and read
  //   what it checks before accepting a PAIR_ACK. Write the answer in a comment.

  if (millis() - connectStart > CONNECT_WINDOW){
    paired = false;
    mode = Mode::PAIRING;
  } 
  delay(500);                                // retry cadence while connecting
}

// ONLINE — the normal job: ask the master what state it wants, move if needed.
static void runOnline() {
  // Remembers (across calls) when we last actually moved the plate, so we can
  // poll quickly for a short while after activity. `static` = keeps its value.
  static uint32_t lastMove = 0;

  gotCmd = false;
  sendPoll();
  Serial.printf("POLL sent (current=%u)\n", (unsigned)myState);
  uint32_t start = millis();
  while (!gotCmd && millis() - start < 500) { delay(5); }

  if (gotCmd) {
    Serial.printf("CMD reply: desired=%u (we are %u)\n",
                  (unsigned)cmdWant, (unsigned)myState);
    // Don't drive the servo for the first ~1.5s after boot: let the rail settle
    // so the boot inrush + a move can't coincide and brown us out (and so a
    // brownout can't turn into a move-reset-move loop).
    if (cmdWant != myState && millis() > SERVO_BOOT_DELAY_MS) {
      movePlate(cmdWant); lastMove = millis();
    }
  } else {
    Serial.println("no reply (master out of range?)");
  }

  // Adaptive poll rate: for a few seconds after a move the supervisor may toggle
  // again, so stay responsive (poll fast). When idle, slow right down to save
  // battery. (We can't react faster than this to the FIRST press after idle —
  // the edge only learns of a change when it polls.)
  // Poll fast right after boot (so the first move lands ~1.5s in) and for a few
  // seconds after any move; otherwise slow down to save power.
  bool recentlyActive = (lastMove != 0 && millis() - lastMove < 5000) || millis() < 4000;
  uint32_t wait = recentlyActive ? 250 : cmdPollMs;   // master paces idle rate (fast if phone present)
  usbAwareDelay(wait);                                 // keep watching the USB lead through the idle gap
}

// PAIRING — shout "pair me" until a master in pair mode answers and adopts us.
static void broadcastForPairing() {
  digitalWrite(PIN_LED, (millis() / 250) & 1);   // blink while pairing
  sendPairReq();
  uint32_t start = millis();
  while (!gotAck && millis() - start < REQ_EVERY) { delay(5); }
  if (!gotAck) return;                       // no answer yet — try again next loop

  // memcpy(dest, src, n) = copy n bytes. ackMaster was filled by the callback
  // with the MAC of whoever sent the PAIR_ACK — that's our new master.
  memcpy(masterMac, ackMaster, 6);
  addMaster();
  paired = true;
  gotAck = false;
  saveConfig();                              // remember the master across power-off
  Serial.printf("PAIRED to %02X:%02X:%02X:%02X:%02X:%02X\n",
                masterMac[0],masterMac[1],masterMac[2],
                masterMac[3],masterMac[4],masterMac[5]);
  digitalWrite(PIN_LED, HIGH);
  mode = Mode::ONLINE;                        // adopted -> go live
}

// This is the heart of the program. Arduino calls it over and over, forever.
// Read top-to-bottom: housekeeping first, then "do the current mode's job".
void loop() {
  checkBattery();
  handleSerial();
  handleButton();
  pollUsbGesture();                // unplug/replug the USB lead 3x = factory reset

  if (gotUnpair) {                 // master told us to disconnect
    gotUnpair = false;
    Serial.println("master sent UNPAIR — forgetting it and re-pairing");
    forgetMaster();                // drop the peer, paired=false, mode=PAIRING
    saveConfig();                  // persist so a reboot doesn't auto-reconnect
  }

  handleCal();                     // apply any over-the-air calibration request
  checkCalTimeout();               // power the servo down if jogging went idle
  if (calLive) { delay(10); return; }   // hold the servo still while calibrating

  switch (mode) {
    case Mode::CONNECTING: tryReconnect();        break;
    case Mode::ONLINE:     runOnline();           break;
    case Mode::PAIRING:    broadcastForPairing();  break;
  }
}
